
Процедура ОбработкаПроведения(Отказ, Режим)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бронирование.НачалоБрони КАК НачалоБрони,
		|	Бронирование.КонецБрони КАК КонецБрони,
		|	Бронирование.Регистратор.Клиент КАК Клиент,
		|	Бронирование.Регистратор.Клиент.Телефон КАК Телефон
		|ИЗ
		|	РегистрСведений.Бронирование КАК Бронирование
		|ГДЕ
		|	Бронирование.Компьютер = &Компьютер
		|	И (&ДатаНачала МЕЖДУ Бронирование.НачалоБрони И Бронирование.КонецБрони
		|			ИЛИ &ДатаОкончания МЕЖДУ Бронирование.НачалоБрони И Бронирование.КонецБрони
		|			ИЛИ Бронирование.НачалоБрони МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИЛИ Бронирование.КонецБрони МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИЛИ &ДатаНачала <= Бронирование.НачалоБрони
		|				И &ДатаОкончания >= Бронирование.КонецБрони)
		|	И Бронирование.Регистратор <> &Регистратор";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоБрони);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецБрони);
	Запрос.УстановитьПараметр("Компьютер", Компьютер); 
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОТказ = Истина;	
		Сообщить("Этот компьютер забронирован клиентом: " + ВыборкаДетальныеЗаписи.Клиент + "тел: " + ВыборкаДетальныеЗаписи.Телефон);
	КонецЦикла;
	
	// регистр Выручка   
	Движения.Выручка.Записывать = Истина;   
	Если Оплачено Тогда
		Движение = Движения.Выручка.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Сумма = Сумма;   
	КонецЕсли;
	
	// регистр Бронирование
	Движения.Бронирование.Записывать = Истина;
	Движение = Движения.Бронирование.Добавить();
	Движение.НачалоБрони = НачалоБрони;
	Движение.КонецБрони = КонецБрони;
	Движение.Компьютер = Компьютер;

КонецПроцедуры
