 
 
&НаКлиенте
Процедура НачалоКонецБрониПриИзменении(Элемент)		
    Объект.КоличествоЧасов = 12;
	Если НЕ (ЗначениеЗаполнено(Объект.НачалоБрони) И ЗначениеЗаполнено(Объект.КонецБрони)) Тогда
		Объект.КоличествоЧасов = 0;	
		
	ИначеЕсли Объект.НачалоБрони >= Объект.КонецБрони Тогда
		Объект.КоличествоЧасов = 0;
		Сообщить("Вы указали неправильное время, ошибка");
		
	Иначе
		Объект.КоличествоЧасов = Окр((Объект.КонецБрони - Объект.НачалоБрони) / 60 / 60, 1);
	КонецЕсли;     
	
КонецПроцедуры 

