&НаСервереБезКонтекста
Функция ПриСозданииНаСервере(Клиент) Экспорт

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ВыручкаОбороты.Клиент КАК Клиент,
    |   СУММА(ВыручкаОбороты.СуммаОборот) КАК СуммаОборот
    |ИЗ
    |   РегистрНакопления.Выручка.Обороты(, , , Клиент = &Клиент) КАК ВыручкаОбороты
    |СГРУППИРОВАТЬ ПО
    |   ВыручкаОбороты.Клиент";

    Запрос.УстановитьПараметр("Клиент", Клиент);

    Результат = Запрос.Выполнить().Выбрать();

    Если Результат.Следующий() Тогда
        Возврат Результат.СуммаОборот;
    КонецЕсли;

    Возврат 0;

КонецФункции

&НаКлиенте
Процедура Перезагрузить(Команда)

    // Передаём ссылку текущего объекта
    Выручка = ПриСозданииНаСервере(Объект.Ссылка);

    // Записываем результат в реквизит формы
    ВыручкаСКлиента = Выручка;

КонецПроцедуры

