Функция ПолучитьЗаголовок() Экспорт
	Возврат Константы.НаименованиеКлуба.Получить()
КонецФункции    

Функция ПолучитьИмя() Экспорт
	Возврат Константы.ГенеральныйДиректор.Получить()
КонецФункции    


Функция ПолучитьЦену(ТоварУслуга, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(&Дата, ТоварУслуга = &ТоварУслуга) КАК ЦеныСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ТоварУслуга", ТоварУслуга);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
	КонецЦикла;   
	
	Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Цена) Тогда
		Возврат ВыборкаДетальныеЗаписи.Цена;     
	Иначе
		Возврат 0;    
	КонецЕсли;

	
КонецФункции // ПолучитьЦену()

&НаСервере
Процедура Правила(ТабДок, СсылкаНаДокумент)  Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бронь.Номер КАК Номер,
		|	Бронь.Дата КАК Дата
		|ИЗ
		|	Документ.Бронь КАК Бронь
		|ГДЕ
		|	Бронь.Ссылка = &СсылкаНаДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Бронь.Клиент КАК Клиент,
		|	Бронь.Компьютер КАК Компьютер,
		|	Бронь.НачалоБрони КАК НачалоБрони,
		|	Бронь.КонецБрони КАК КонецБрони,
		|	Бронь.Сумма КАК Сумма
		|ИЗ
		|	Документ.Бронь КАК Бронь
		|ГДЕ
		|	Бронь.Ссылка = &СсылкаНаДокумент";
	
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);    
	
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеЗаголовок = МассивРезультатовЗапроса[0];
	ДанныеШапка = МассивРезультатовЗапроса[1];

	
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;             
	
	ВыборкаЗаголовок = ДанныеЗаголовок.Выбрать();
	ВыборкаЗаголовок.Следующий();
	
	ВыборкаШапка = ДанныеШапка.Выбрать();
	ВыборкаШапка.Следующий(); 
	
	НазваниеКлуба = Константы.НаименованиеКлуба.Получить();
	                                    
	
	
	Макет = Документы.Бронь.ПолучитьМакет("СогласияСПравилами"); 
	
	ОбластьНазвание = Макет.ПолучитьОбласть("Название"); 
	ОбластьНазвание.Параметры.НазваниеКлуб = НазваниеКлуба;
	ТабДок.Вывести(ОбластьНазвание);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");      
	ОбластьЗаголовок.Параметры.Номер = ВыборкаЗаголовок.Номер; 
	ОбластьЗаголовок.Параметры.Дата = Формат(ВыборкаЗаголовок.Дата, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(ОбластьЗаголовок);

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Клиент = ВыборкаШапка.Клиент; 
	ОбластьШапка.Параметры.Компьютер = ВыборкаШапка.Компьютер;
	ОбластьШапка.Параметры.НачалоБрони = ВыборкаШапка.НачалоБрони; 
	ОбластьШапка.Параметры.КонецБрони = ВыборкаШапка.КонецБрони; 
	ОбластьШапка.Параметры.Сумма = ВыборкаШапка.Сумма;
	ТабДок.Вывести(ОбластьШапка);

	ОбластьПолныеПравила = Макет.ПолучитьОбласть("ПолныеПравила");	
	ТабДок.Вывести(ОбластьПолныеПравила);

    ОбластьПравила = Макет.ПолучитьОбласть("Правила");   
	ТабДок.Вывести(ОбластьПравила);

	ОбластьПодпись = Макет.ПолучитьОбласть("Подпись");  
	ТабДок.Вывести(ОбластьПодпись);

	
КонецПроцедуры




